// Operators

let lessons = 10;

lessons = 10 + 10;
lessons = 10 - 5;
lessons = 10 * 10;
lessons = 10 / 10;
lessons = 11 % 2; // остаток от деления

// console.log(lessons);
// -----------------------------------

let x;
x = 2 ** 2; // 4 (возводит в степень)
x = 2 ** 3; // 8

x = 1;
// x = x + 1; // то же, что и x++
x++; // то же, что и x = x + 1
// x = x - 1; // то же, что и x--
x--; // то же, что и x = x - 1

// console.log(x);
// -----------------------------------

let a = 10;
// для присвоения переменных
// a++ постфиксный инкремент
// ++a префиксный инкремент
// a-- постфиксный декремент
// --a префиксный декремент

let b = a++;
// console.log(b) // 10
// console.log(a) // 11

let c = --a;
// console.log(c) // 10
// console.log(a) // 10
// -----------------------------------

// Операторы присваивания
let d = 10;

d += 1; // d = d + 1
d -= 1 // d = d - 1
d *= 1; // d = d * 1
d /= 1; // d = d / 1
d %= 2; // d = d % 2
d = d ** 2; // d = d ** 2
// -----------------------------------

// Операторы сравнения
// >, <, >=, <=
// ==, ===, !=, !== (также более подробно в 8 уроке)

console.log(1 == 1);
console.log(1 === 1);

console.log(1 == '1');
console.log(1 === '1');

console.log(1 != '1');
console.log(1 !== '1');
// -----------------------------------

// Конкатенация
const greeting = 'Hello ' + 'World!';

console.log(greeting);
console.log(1 + ' lalala');
